[
  { "p": "loadstring", "r": "[CRITICAL] Remote Code Execution: Menjalankan kode kontrol jarak jauh dari server eksternal secara langsung." },
  { "p": "getfenv", "r": "[CRITICAL] Environment Hijacking: Upaya modifikasi proteksi keamanan internal dan akses memori sistem." },
  { "p": "setfenv", "r": "[CRITICAL] Environment Manipulation: Upaya mengganti kontrol lingkungan sistem secara ilegal." },
  { "p": "require%(%d+%)", "r": "[WARNING] External Module: Memanggil modul luar via Asset ID. Pastikan ID berasal dari sumber tepercaya." },
  { "p": "require%(.*%.Value%)", "r": "[CRITICAL] Hidden Require ID: Memanggil modul dari objek Value (Pose/NumberValue). Teknik menyembunyikan Asset ID asli." },
  { "p": "\\\\[0-9][0-9][0-9]", "r": "[CRITICAL] Decimal Obfuscation: Kode dikaburkan menggunakan angka (Bytecode) untuk menyembunyikan malware." },
  { "p": "\\\\x%x%x", "r": "[CRITICAL] Hex Obfuscation: Penggunaan kode Hexadecimal untuk mengelabui deteksi teks standar." },
  { "p": "game:HttpGet", "r": "[WARNING] Legacy HTTP Fetch: Metode pengambilan data eksternal yang sering digunakan backdoor lama." },
  { "p": "game:HttpPost", "r": "[WARNING] External Data Send: Skrip mencoba mengirimkan data game Anda ke server luar." },
  { "p": "https?://[%w-_%.%?%.:/%+=&]+", "r": "[SUSPICIOUS] External Link: Ditemukan tautan web. Waspada pengiriman data (logging) rahasia ke server luar." },
  { "p": "string%.reverse", "r": "[SUSPICIOUS] Pattern Masking: Teknik membalik teks (seperti 'gnirtsdaol') untuk menyembunyikan perintah berbahaya." },
  { "p": "string%.char", "r": "[SUSPICIOUS] Dynamic Code Build: Membangun perintah berbahaya dari karakter angka agar tidak terbaca scanner." },
  { "p": "gsub%(%'.%',.*byte", "r": "[SUSPICIOUS] Byte Conversion: Teknik mengubah teks menjadi byte untuk membangun kode terenkripsi." },
  { "p": "InsertService:LoadAsset", "r": "[CRITICAL] Asset Injection: Memasukkan model atau skrip dari luar secara real-time ke dalam proyek." },
  { "p": "MarketplaceService:GetProductInfo", "r": "[INFO] Marketplace Check: Sering disalahgunakan untuk aktivasi ID malware secara otomatis." },
  { "p": "ChildSignal,.*%.Value%)%.Description", "r": "[CRITICAL] Dynamic Description Execution: Mengeksekusi kode jahat yang disembunyikan di deskripsi produk Marketplace." },
  { "p": "jobid", "r": "[SUSPICIOUS] Anti-Studio Stealth: Skrip mendeteksi lingkungan Studio agar bisa bersembunyi saat Anda mengedit." },
  { "p": "LogService:ClearOutput", "r": "[CRITICAL] Evidence Eraser: Perintah paksa menghapus log Studio agar jejak malware hilang." },
  { "p": "clearoutput", "r": "[WARNING] Evidence Eraser: Upaya otomatis menghapus riwayat peringatan sistem di jendela Output." },
  { "p": "LogService", "r": "[SUSPICIOUS] Log Monitoring: Memantau riwayat error untuk mendeteksi atau menghapus jejak aktivitas jahat." },
  { "p": "game%.CreatorId", "r": "[SUSPICIOUS] Creator Validation: Memeriksa ID pemilik game untuk memastikan tidak berjalan di tempat pemilik aslinya." },
  { "p": "script:Destroy%(%)", "r": "[WARNING] Self-Destruction: Skrip menghapus dirinya sendiri secara otomatis untuk menyembunyikan jejak." },
  { "p": "FindFirstChild%(%\"Async%\"", "r": "[CRITICAL] Anti-Security Check: Mencari sistem keamanan 'Async' untuk mematikan fungsi scanner Anda secara paksa." },
  { "p": "TeleportService", "r": "[WARNING] Player Hijack: Berpotensi memindahkan pemain ke game lain secara paksa tanpa izin." },
  { "p": "_G%[", "r": "[SUSPICIOUS] Global Variable Abuse: Menyisipkan fungsi berbahaya ke tabel global agar bisa diakses secara rahasia." },
  { "p": "%.Source%s*=%s*[%w_%.]+", "r": "[WARNING] Script Rewriting: Skrip mencoba menulis ulang kode skrip lain. Risiko tinggi penyisipan backdoor baru." },
  { "p": "for%s*i%s*=%s*1,%s*%d+%s*do%s*print", "r": "[SUSPICIOUS] Log Flooding: Membanjiri Output dengan pesan kosong untuk menutupi error dari skrip virus." },
  { "p": "NumberPose", "r": "[WARNING] Hidden ID Storage: Objek NumberPose sering digunakan menyimpan ID modul backdoor secara fisik." },
  { "p": "script:GetTags%(%)", "r": "[SUSPICIOUS] Tag Injection: Menggunakan Metadata Tags untuk menyisipkan perintah rahasia yang tidak tertulis di kode." },
  { "p": "::%s*%w+", "r": "[WARNING] Type Assertion Bypass: Sintaks Luau (::) digunakan untuk membingungkan parser scanner." },
  { "p": "Instance%.new%(%\"%\"%)", "r": "[SUSPICIOUS] Ghost Instance: Membuat objek tanpa class yang jelas untuk memicu error atau menyembunyikan pesan." },
  { "p": "c4e784ba3faf7661d793b1445509c65c", "r": "[CRITICAL] Malware Hash: Tanda tangan aset yang terverifikasi terkait dengan malware Noob History." },
  { "p": "MoonSec|Luraph|77fuscator|Vanguard|PSU", "r": "[CRITICAL] Known Obfuscator: Skrip menggunakan layanan enkripsi pihak ketiga yang identik dengan penyebaran malware." },
  { "p": "webhook|vapi|wearedevs", "r": "[WARNING] Malicious API: Referensi ke API luar yang sering digunakan untuk logging data pemain secara ilegal." }
]
