[
  { "p": "loadstring", "r": "[CRITICAL] Remote Code Execution: Menjalankan kode kontrol jarak jauh dari server eksternal secara langsung." },
  { "p": "getfenv", "r": "[CRITICAL] Environment Hijacking: Upaya modifikasi proteksi keamanan internal dan akses memori sistem." },
  { "p": "require%(%d+%)", "r": "[WARNING] External Module: Memanggil modul luar via Asset ID. Pastikan ID berasal dari sumber tepercaya." },
  { "p": "\\\\[0-9][0-9][0-9]", "r": "[CRITICAL] Decimal Obfuscation: Kode sengaja dikaburkan menggunakan angka (Bytecode) untuk menyembunyikan malware." },
  { "p": "\\\\x%x%x", "r": "[CRITICAL] Hex Obfuscation: Penggunaan kode Hexadecimal untuk mengelabui deteksi teks standar." },
  { "p": "setfenv", "r": "[CRITICAL] Environment Manipulation: Upaya mengganti kontrol lingkungan sistem secara ilegal." },
  { "p": "game:HttpGet", "r": "[WARNING] Legacy HTTP Fetch: Penggunaan metode pengambilan data eksternal yang sering digunakan backdoor lama." },
  { "p": "game:HttpPost", "r": "[WARNING] External Data Send: Skrip mencoba mengirimkan data game Anda ke server luar." },
  { "p": "https?://[%w-_%.%?%.:/%+=&]+", "r": "[SUSPICIOUS] External Link: Ditemukan tautan web. Pastikan ini bukan pengirim data (logging) rahasia ke server peretas." },
  { "p": "string%.reverse", "r": "[SUSPICIOUS] Pattern Masking: Teknik membalik teks (seperti 'gnirtsdaol') untuk menyembunyikan perintah loadstring." },
  { "p": "string%.char", "r": "[SUSPICIOUS] Dynamic Code Build: Membangun perintah berbahaya dari kumpulan karakter angka agar tidak terbaca." },
  { "p": "InsertService:LoadAsset", "r": "[CRITICAL] Asset Injection: Memasukkan model atau skrip dari luar secara real-time ke dalam proyek Anda." },
  { "p": "MarketplaceService:GetProductInfo", "r": "[INFO] Marketplace Check: Sering disalahgunakan backdoor untuk aktivasi ID malware secara otomatis." },
  { "p": "jobid", "r": "[SUSPICIOUS] Anti-Studio Stealth: Skrip mencoba mendeteksi lingkungan Studio agar bisa bersembunyi saat Anda mengedit." },
  { "p": "clearoutput", "r": "[WARNING] Evidence Eraser: Upaya otomatis menghapus riwayat peringatan sistem di jendela Output." },
  { "p": "LogService", "r": "[SUSPICIOUS] Log Monitoring: Memantau riwayat error untuk mendeteksi dan menghapus jejak aktivitas jahat." },
  { "p": "game%.CreatorId", "r": "[SUSPICIOUS] Creator Validation: Skrip memeriksa ID pemilik game. Sering digunakan backdoor untuk memastikan mereka tidak berjalan di tempat pemilik aslinya." },
  { "p": "script:Destroy%(%)", "r": "[WARNING] Self-Destruction: Skrip mencoba menghapus dirinya sendiri secara otomatis. Ini perilaku mencurigakan untuk menyembunyikan jejak saat terdeteksi scanner." },
  { "p": "FindFirstChild%(%\"Async%\"", "r": "[CRITICAL] Anti-Security Check: Skrip mencoba mencari sistem keamanan 'Async' untuk mematikan fungsi scanner Anda secara paksa." },
  { "p": "TeleportService", "r": "[WARNING] Player Hijack: Berpotensi memindahkan pemain ke game lain secara paksa tanpa izin." },
  { "p": "_G%[", "r": "[SUSPICIOUS] Global Variable Abuse: Menyisipkan fungsi berbahaya ke dalam tabel global agar bisa diakses secara rahasia." },
  { "p": "for%s*i%s*=%s*1,%s*%d+%s*do%s*print", "r": "[SUSPICIOUS] Log Flooding: Teknik membanjiri jendela Output dengan pesan kosong untuk menyembunyikan error dari skrip virus." },
  { "p": "NumberPose", "r": "[WARNING] Hidden ID Storage: Penggunaan objek NumberPose yang sering disalahgunakan untuk menyimpan ID modul backdoor agar tidak terlihat seperti angka biasa." },
  { "p": "LogService:ClearOutput", "r": "[CRITICAL] Evidence Eraser: Perintah paksa untuk menghapus seluruh riwayat log di Studio agar jejak malware hilang." },
  { "p": "require%(.*%.Value%)", "r": "[CRITICAL] Hidden Require ID: Memanggil modul dari objek Value (Pose/NumberValue). Ini teknik untuk menyembunyikan Asset ID asli dari scanner." },
  { "p": "script:GetTags%(%)", "r": "[SUSPICIOUS] Tag Injection: Menggunakan sistem Metadata Tags untuk menyisipkan perintah rahasia yang tidak tertulis di kode sumber." },
  { "p": "::%s*%w+", "r": "[WARNING] Type Assertion Bypass: Menggunakan sintaks Luau (::) untuk membingungkan parser scanner agar tidak mengenali objek berbahaya." },
  { "p": "Instance%.new%(%\"%\"%)", "r": "[SUSPICIOUS] Ghost Instance: Membuat objek tanpa class yang jelas, sering digunakan untuk memicu error pada UI atau menyembunyikan pesan malware." },
  { "p": "c4e784ba3faf7661d793b1445509c65c", "r": "[CRITICAL] Malware Hash: Deteksi tanda tangan (hash) aset yang sering terkait dengan ikon/decal malware Noob History." },
  { "p": "ChildSignal,.*%.Value%)%.Description", "r": "[CRITICAL] Dynamic Description Execution: Mengambil dan mengeksekusi kode jahat yang disembunyikan di dalam deskripsi produk Marketplace." },
  { "p": "gsub%(%'.%',.*byte", "r": "[SUSPICIOUS] Byte Conversion: Teknik mengubah teks menjadi tumpukan angka (byte) untuk membangun kode terenkripsi secara otomatis." }
]
